package com.yang.game;

import java.util.*;
import java.util.function.Function;
import java.util.stream.Collectors;

/**
 * 题库
 */
public class ConditionCollections {

    public final static Map<Integer, Condition> CONDITION_MAP = new TreeMap<>();

    static {
        // 初始化题库
        initCondition();
    }

    private static void initCondition() {
        // 题目内容
        Map<Integer, String> conditionContents = getConditionContents();
        // 题目选项
        Map<Integer, Map<Integer,Choice>> choices = getConditionChoices();
        // 题目结局
        Map<Integer, Ending> endings = getEndings();
        // 题目余结局的映射关系
        Map<Integer, Integer> conditionEndMapping = getConditionEndMapping();
        conditionContents.forEach((conditionId, content) -> {
            Condition condition = new Condition();
            condition.setId(conditionId);
            condition.setName("题目" + conditionId);
            condition.setContent(content);
            Map<Integer,Choice> choiceMap = choices.get(conditionId);
            if (choiceMap == null || choiceMap.isEmpty()) {
                // 表示这道题就是终点
                condition.setEnded(true);
                condition.setEnding(endings.get(conditionEndMapping.get(conditionId)));
            } else {
                // 不是终点
                condition.setChoices(choiceMap);
            }
            CONDITION_MAP.put(conditionId, condition);
        });
    }

    private static Map<Integer, Integer> getConditionEndMapping() {
        Map<Integer, Integer> map = new HashMap<>();
        map.put(27, 0);
        map.put(28, 0);
        map.put(38, 0);
        map.put(51, 0);
        map.put(54, 0);
        map.put(55, 0);
        map.put(69, 0);
        map.put(78, 0);
        map.put(80, 0);
        map.put(84, 0);
        map.put(88, 0);
        map.put(89, 0);
        map.put(96, 0);
        map.put(111, 0);
        map.put(126, 0);
        map.put(128, 0);

        map.put(50, 1);
        map.put(52, 2);
        map.put(109, 3);
        map.put(87, 4);
        map.put(90, 5);
        map.put(101, 6);
        map.put(94, 7);
        map.put(106, 7);
        map.put(117, 8);
        map.put(121, 9);
        map.put(124, 10);
        map.put(125, 11);
        map.put(129, 12);

        return map;
    }

    private static Map<Integer, Map<Integer, Choice>> getConditionChoices() {
        List<Choice> choices = initConditionChoice();
        return choices.stream().collect(Collectors.groupingBy(Choice::getConditionId, Collectors.toMap(Choice::getId, Function.identity())));
    }

    private static Map<Integer, Ending> getEndings() {
        Map<Integer, Ending> endingMap = new HashMap<>();
        endingMap.put(0, new Ending(1, "death", "选择率：60.08%！\n" +
                "结局评价：人们在法制社会下逐渐失去危机感，正因为太平常，人命，才会变得如此脆弱，不堪一击。近来报道中，不时有年轻生命不辞而别，他们都源自于生活中琐碎的小事，细微的不能再细微，甚至发生在我周边...希望大家以此为戒，保持生命的珍贵\n" +
                "\n" +
                "第一批下楼一定是最为危险的，到地面就一定安全了吗？每次death前题目一定有所暗示哦~\n"));
        endingMap.put(1, new Ending(2, "结局A", "结局：麻瓜\n" +
                "当前楼层：9楼\n" +
                "选择率：3.07%\n" +
                "楼层危险率：良好\n" +
                "存活概率：3.07%\n" +
                "拥有伙伴：无\n" +
                "结局评价：首先先恭喜你成为本章为数不多的开始就结束的阅读体验，因前期“憋尿”而丧失了诸多机遇，但也避免了“未知”的发生，警惕心较弱，对人性的思考与蝴蝶效应的认知较低，你最终都不知道到底发生了什么，在9楼上完厕所之后将会面临“挤不下”、“暴乱”等情况，甚至有“不可控”因素危及生命，末日下分秒必争，“逼到死角会爆发一定潜力”是你的优点，但在末日下不可取，往往逼到那时已“十死无生”\n" +
                "\n" +
                "\n"));
        endingMap.put(2, new Ending(3, "结局B", "结局：命悬一线\n" +
                "当前楼层：10楼\n" +
                "选择率：0.60%\n" +
                "楼层危险率：重灾区\n" +
                "存活概率：0.5%\n" +
                "拥有伙伴：无\n" +
                "结局评价：首先先恭喜你获得了本章最低生存率，其次你也非常荣幸的成为本章为数不多的开始就结束的阅读体验，你因前期的“憋尿”丧失了诸多机遇，但也避免了“未知”的发生，警惕心可谓非常之弱，对人性的思考与蝴蝶效应的认知较低，在最后，你非常成功的get到事件的严重，但为时已晚\n" +
                "\n"));
        endingMap.put(3, new Ending(4, "结局C", "结局：抉择\n" +
                "当前楼层：7楼\n" +
                "选择率：10.05%（选到此结局人数：高）\n" +
                "楼层危险率：重灾区\n" +
                "存活概率：5%\n" +
                "拥有伙伴：\n" +
                "\n" +
                "\n" +
                "UI琴姐：会照顾人，偶尔拖后腿，胸大无脑，智力一般无主见，神经大条天然呆\n" +
                "\n" +
                "\n" +
                "楼道总管黄叔：为人憨厚，心宽体胖，做事粗中有细，想法面面俱到，处事圆滑\n" +
                "\n" +
                "\n" +
                "运营小刚：应届生，愤青，做事欠考虑但极有底线原则，正义感强\n" +
                "\n" +
                "\n" +
                "结局评价：有三个伙伴，生存率会略微提高，但身在“重灾区”却依然九死一生，理念不同与拖后腿也很容易成为你道德的评判标准，“不可控”因素致伙伴的身亡会崩坏你的三观，或坚定，或懦弱，有多少人会因你而死，而你的活又代表了多少人的精神寄托？往后抉择只会异常艰难，走错一步，天人两岸\n" +
                "\n"));
        endingMap.put(4, new Ending(5, "结局D", "结局：祸不单行\n" +
                "当前楼层：6楼\n" +
                "选择率：12.50%（选到此结局人数：高）\n" +
                "楼层危险率：优\n" +
                "存活概率：4.5%\n" +
                "拥有伙伴：无\n" +
                "结局评价：选至该处的人，不是对人性有一定了解，就是以身试险并从中做出了正确的抉择。6楼是为数不多的无危险楼层，因军方大规模攻击所造成的余波多是该层，员工早已落荒而逃，散乱离开，但存活率依然不高，清醒后将面临头晕眼花，失血过多等症状，且无依无靠，没可信之人搭把手，有些事物终是独自完不成的，当然，能选至此处，至少活下来了\n" +
                "\n" +
                "\n"));
        endingMap.put(5, new Ending(6, "结局E", "结局：惝恍如梦\n" +
                "当前楼层：10楼\n" +
                "选择率：0.31%\n" +
                "楼层危险率：重灾区\n" +
                "存活概率：1%\n" +
                "拥有伙伴：无\n" +
                "结局评价：瞬间发生的事让你惝恍如梦一般，躲在角落，敏感的神经，断了线的大脑也许会让你走到两个极端，你做了正确的选择也做了错误的选择，选至此处必是舍弃了什么，可能是勇气，可能是善意，也可能是人性。为了生存，你可以不择手段，但一些杂念与错误的判断差点让你埋葬深海，不过终是绝处逢生，如能在大楼成功逃脱，你将直视自己的弱小，往后会变的更强\n" +
                "\n" +
                "\n"));
        endingMap.put(6, new Ending(7, "结局F", "结局：情同手足\n" +
                "当前楼层：5楼\n" +
                "选择率：2.56%\n" +
                "楼层危险率：优\n" +
                "存活概率：37%\n" +
                "拥有伙伴：\n" +
                "\n" +
                "小王：军事迷，同事兼死党，智力超群，情商较低，与你情同手足，生存率大大提升\n" +
                "\n" +
                "结局评价：选到此结局说明你非常的优秀，能敏锐感受出周况的不同，捕捉到末微细节，从而脱颖而出并与小王同聚，小王是为数不多的智将，在此处，你处于辅助听从位较多，他主，你辅，在放大小王智力的同时，或许会磨灭掉你菱角与性情，需把握好争执点与权重问题，5楼是低楼，安全的同时也伴随着重重危难，这是存活率仍较低的主要原因\n" +
                "\n"));
        endingMap.put(8, new Ending(8, "结局G", "结局：无助\n" +
                "当前楼层：9楼\n" +
                "选择率：后期统计\n" +
                "楼层危险率：良好\n" +
                "存活概率：2.58%\n" +
                "拥有伙伴：无\n" +
                "结局评价：不在沉默中死去，就在沉默中爆发，错误的选择让你前功尽弃，或悲痛不已，或悔不当初，好在9楼状况良好，暂受不到致命的威胁，能让你喘息一会。小王的离去是一个致命的打击，是否能意识到事情的严重从而洗心革面焕然一新，还是心有死志，在沉默悲痛中了却此生，不同人不同选择，面对“它们”，比死亡更困难的或许就是活着\n" +
                "\n"));
        endingMap.put(8, new Ending(9, "结局H", "结局：哥罩着你\n" +
                "当前楼层：8楼\n" +
                "选择率：7.59%（选到此结局人数：高）\n" +
                "楼层危险率：优\n" +
                "存活概率：41%\n" +
                "拥有伙伴：\n" +
                "\n" +
                "小王：军事迷，同事兼死党，智力超群，情商较低，与你情同手足，生存率大大提升\n" +
                "\n" +
                "结局评价：选到此结局说明你非常的优秀，能敏锐感受出周况的不同，捕捉到末微细节，从而脱颖而出并与小王同聚，小王是为数不多的智将，在此处，你主位较多，他辅，虽在一定情况下缩小了他智力的决策，但因你舍命救他，不抛弃的精神让他感触良多，你更能感受“相”的重要性，存活率近50%，相当优异\n" +
                "\n"));
        endingMap.put(9, new Ending(10, "结局I", "结局：红颜（隐藏结局）\n" +
                "当前楼层：8楼\n" +
                "选择率：0.23%\n" +
                "楼层危险率：优\n" +
                "存活概率：53%\n" +
                "拥有伙伴：\n" +
                "\n" +
                "小莉：高情商，高智商，颜值担当，愿为你以身相报\n" +
                "\n" +
                "结局评价：你拥有胆气、自信力与责任感，能敏锐感受出周况的不同，捕捉到末微细节，捕获女神芳心。小莉不光是公司女神，更是全球高智商俱乐部会员，在你舍命救她并一次次带她脱离险境之时，便在她芳心刻下了磨灭不掉的印记，你们之后或许会遇到诸多“不可控”因素，但你一定能活下来\n" +
                "\n"));
        endingMap.put(10, new Ending(11, "结局J", "结局：眦裂（隐藏结局）\n" +
                "当前楼层：9楼\n" +
                "选择率：0.07%\n" +
                "楼层危险率：良好\n" +
                "存活概率：13%\n" +
                "拥有伙伴：不确定\n" +
                "结局评价：比“未知”更危险的应是“人心”，你非常厌恶的与小辉同在了一楼，他对你的建议视而不见，他更是屡次危及与你害及他人，让你牙呲欲裂，暴跳如雷。9楼里含40多人，势必不会看你打si他，在生存末期，食物的缺少，心态的转变势必会出现帮派之争，而有小辉一样的蛀虫在，让生存变得尤为艰难，或结对出门，或食物纷争，或理念分歧，或感情离析，一步踏错，也许不会死在“它们”\n" +
                "\n"));
        endingMap.put(11, new Ending(12, "结局K", "结局：冷血（隐藏结局）\n" +
                "当前楼层：7楼\n" +
                "选择率：0.24%\n" +
                "楼层危险率：重灾区\n" +
                "存活概率：28%\n" +
                "拥有伙伴：无\n" +
                "结局评价：靠人不如靠己，自食其力，鬼神敬之，自私能提高存活率，冷漠亦然，而冷血更能提高不少，虽终有碰壁之时，你醒悟，或固执，生命却都不会受到太多威胁，因为社会法制的崩坏，自私的人只会越来越多，冷血的道路也会越来越宽，最重要的，是你提前掌握了生存法则，无人敢提你，无人敢骂你，你在活着的岁月里能舒舒服服，没有代价吗？代价就是孤独\n" +
                "\n" +
                "\n"));
        endingMap.put(12, new Ending(13, "结局L", "结局：领袖（隐藏结局）\n" +
                "当前楼层：10楼\n" +
                "选择率：0.12%\n" +
                "楼层危险率：重灾区\n" +
                "存活概率：91%\n" +
                "拥有伙伴：\n" +
                "\n" +
                "\n" +
                "小晓：与志博为情侣，有一定医疗护理技术，曾任职过市级护士，情商非常高\n" +
                "\n" +
                "\n" +
                "志博：与小晓为情侣，聪明过人，热爱建筑，对制图颇有研究\n" +
                "\n" +
                "\n" +
                "雪赵：健身达人，层担任过武警大队三队队长，退伍反乡兼职私人教练\n" +
                "\n" +
                "\n" +
                "小薇：UED，热爱绘画，身材火爆，冷若冰霜，实则内心狂野火辣\n" +
                "\n" +
                "\n" +
                "小王：军事迷，同事兼死党，智力超群，情商较低，与你情同手足，生存率大大提升\n" +
                "\n" +
                "\n" +
                "more...\n" +
                "结局评价：除了已走的，剩余人数多达70之多，庞大之极。你能达到此成就无论是心性、智力、执行力还是舍人为己的勇气都无可挑剔，坐于此位，过化存神，大家的安全将是你避无可避的责任，团队会扩大，也或许会缩小，或许会去救毫不相关之人，也或许会抛弃自己人，但唯一不变的，就是你的存活率，作为精神支柱，他们si，也会让你活，能不能扛起就看你的了\n" +
                "\n"));
        return endingMap;
    }

    private static List<Choice> initConditionChoice() {
        List<Choice> choices = new ArrayList<>();
        choices.add(new Choice(1, 1, "1. 工作吧，打开vscode，整理思路", 2));
        choices.add(new Choice(1, 2, "2. 心情不好，哪有时间码代码，去看看窗外", 3));
        choices.add(new Choice(1, 3, "3. 有点想上厕所，去厕所", 4));

        choices.add(new Choice(2, 1, "1. 去厕所", 5));
        choices.add(new Choice(2, 2, "2. 老板的活快干完了，憋着干干完再去！", 6));
        choices.add(new Choice(2, 3, "3. 窗外不时有救护车、警车、消防车经过，窗外这是怎么了？去看窗外", 8));

        choices.add(new Choice(3, 1, "1. 去厕所", 7));
        choices.add(new Choice(3, 2, "2. 回去干活", 2));

        choices.add(new Choice(4, 1, "1. 还是要进去，以前也不是没进去过", 9));
        choices.add(new Choice(4, 2, "2. 憋回去，先去干会活", 2));
        choices.add(new Choice(4, 3, "3. 去楼下的厕所", 10));

        choices.add(new Choice(5, 1, "1. 去窗外看看", 11));
        choices.add(new Choice(5, 2, "2. 先回去干活，年轻人就是沉不住气", 12));

        choices.add(new Choice(6, 1, "1. 去窗外看看", 13));
        choices.add(new Choice(6, 2, "2. 上厕所要紧", 14));

        choices.add(new Choice(7, 1, "1. 去男厕", 17));
        choices.add(new Choice(7, 2, "2. 去女厕", 18));

        choices.add(new Choice(8, 1, "1. 呼吁你周边的朋友，同事，主管来看看，以观后续发展", 15));
        choices.add(new Choice(8, 2, "2. 上厕所要紧", 16));

        choices.add(new Choice(9, 1, "1. 转身离开", 12));
        choices.add(new Choice(9, 2, "2. 寻声过去询问", 19));

        choices.add(new Choice(10, 1, "1. 回楼上工作，不干完绩效不要了？", 12));
        choices.add(new Choice(10, 2, "2. 走过去唠嗑（今年刚换的新手机怎么这么不经用呢？也是佛了）", 21));

        choices.add(new Choice(11, 1, "1. 跟周边的同事讲，要冷静，安分守己，不作为是现在最好的作为", 23));
        choices.add(new Choice(11, 2, "2. 大声呼吁，赶紧跑，政府疯啦！", 24));
        choices.add(new Choice(11, 3, "3. 明哲保身最重要，独自跑！", 25));

        choices.add(new Choice(12, 1, "1. 跟周边的同事讲，要冷静，安分守己，不作为是现在最好的作为", 23));
        choices.add(new Choice(12, 2, "2. 呼吁周边人，快跑", 24));
        choices.add(new Choice(12, 3, "3. 去看窗边到底发生了什么", 27));

        choices.add(new Choice(13, 1, "1. 去厕所", 14));

        choices.add(new Choice(14, 1, "1. 是男人就忍着，硬刚", 28));
        choices.add(new Choice(14, 2, "2. 受不了，还是去楼下厕所吧", 29));

        choices.add(new Choice(15, 1, "1. 此事不简单！继续查看", 30));
        choices.add(new Choice(15, 2, "2. 上厕所要紧", 31));

        choices.add(new Choice(16, 1, "1. 回去继续看事后的发展，这很重要！", 11));
        choices.add(new Choice(16, 2, "2. 没心思工作了，去9楼找你的好哥们小王谈谈今天的事情发展", 21));

        choices.add(new Choice(17, 1, "1. 敲门询问...", 34));
        choices.add(new Choice(17, 2, "2. 离开吧，最多只是被惊吓了，没什么大不了，回去工作", 35));

        choices.add(new Choice(18, 1, "1. 拉（她？）出来！", 36));
        choices.add(new Choice(18, 2, "2. 赶紧跑，什么都顾不上了，先离开此地！", 29));

        choices.add(new Choice(19, 1, "1. 再仔细问问！", 38));
        choices.add(new Choice(19, 2, "2. 离...离开", 39));

        choices.add(new Choice(21, 1, "1. 厕所奇事", 40));
        choices.add(new Choice(21, 2, "2. 迟到苦事", 41));
        choices.add(new Choice(21, 3, "3. 灯光怪事", 42));
        choices.add(new Choice(21, 4, "4. 手机气事", 43));

        choices.add(new Choice(23, 1, "1. 去楼顶，可能是恐怖袭击，直升机会来救！", 44));
        choices.add(new Choice(23, 2, "2. 下楼！", 45));

        choices.add(new Choice(24, 1, "1. 插队，挤进去跑！", 45));
        choices.add(new Choice(24, 2, "2. 等人好些了再进", 47));

        choices.add(new Choice(25, 1, "1. 不带", 48));
        choices.add(new Choice(25, 2, "2. 带", 49));

        choices.add(new Choice(29, 1, "1. 挤！", 50));
        choices.add(new Choice(29, 2, "2. 回同层楼的男厕", 51));

        choices.add(new Choice(30, 1, "1. 再趴着看看", 27));
        choices.add(new Choice(30, 2, "2. 下楼跑啊！", 50));
        choices.add(new Choice(30, 3, "3. 上厕所！", 51));

        choices.add(new Choice(31, 1, "1. 看", 52));
        choices.add(new Choice(31, 2, "2. 不看", 53));

        choices.add(new Choice(34, 1, "1. 离开", 35));
        choices.add(new Choice(34, 2, "2. 进", 54));

        choices.add(new Choice(35, 1, "1. 干什么活，吃瓜去", 11));
        choices.add(new Choice(35, 2, "2. 先干活，绩效不要了？", 12));

        choices.add(new Choice(36, 1, "1. 看看女厕里到底有什么妖魔鬼怪！", 54));
        choices.add(new Choice(36, 2, "2. 拍打或冷水就地叫醒她", 55));
        choices.add(new Choice(36, 3, "3. 哪怕洪水滔天，绯闻肆虐，抱起她回座位", 57));

        choices.add(new Choice(39, 1, "1. 叫他别进去！", 46));
        choices.add(new Choice(39, 2, "2. 打开看看窗外", 58));
        choices.add(new Choice(39, 3, "3. 离开", 59));

        choices.add(new Choice(40, 1, "1. 迟到苦事", 41));
        choices.add(new Choice(40, 2, "2. 手机气事", 60));
        choices.add(new Choice(40, 3, "3. 灯光怪事", 62));

        choices.add(new Choice(41, 1, "1. 灯光怪事", 62));
        choices.add(new Choice(41, 2, "2. 手机气事", 63));

        choices.add(new Choice(42, 1, "1. 手机气事", 63));
        choices.add(new Choice(42, 2, "2. 迟到苦事", 64));
        choices.add(new Choice(42, 3, "3. 厕所奇事", 65));

        choices.add(new Choice(43, 1, "1. 灯光怪事", 62));
        choices.add(new Choice(43, 2, "2. 迟到苦事", 64));
        choices.add(new Choice(43, 3, "3. 厕所奇事", 66));

        choices.add(new Choice(44, 1, "1. 去楼下", 45));

        choices.add(new Choice(45, 1, "1. 随波逐流", 67));

        choices.add(new Choice(46, 1, "1. 挤过去看看", 11));
        choices.add(new Choice(46, 2, "2. 回去工作", 12));

        choices.add(new Choice(47, 1, "1. 叫他赶紧过来", 68));
        choices.add(new Choice(47, 2, "2. 你也过去等一等", 69));

        choices.add(new Choice(48, 1, "1. 决定到9楼叫一下好兄弟小王，有他在会安全很多", 70));
        choices.add(new Choice(48, 2, "2. 不叫了，也许进去后会错失再下楼的时机！", 71));

        choices.add(new Choice(49, 1, "1. 跑过去，赶紧下楼离开这鬼地方！", 69));
        choices.add(new Choice(49, 2, "2. 不过去，样子好怪，先躲一躲", 73));

        choices.add(new Choice(53, 1, "1. Gun你M啊，88", 74));
        choices.add(new Choice(53, 2, "2. 提醒他别过去", 75));

        choices.add(new Choice(57, 1, "1. 带她下楼", 76));
        choices.add(new Choice(57, 2, "2. 通知大家！", 77));

        choices.add(new Choice(58, 1, "1. 进去救他！", 78));
        choices.add(new Choice(58, 2, "2. 下楼，跑！", 79));

        choices.add(new Choice(59, 1, "1. 查看窗外", 11));
        choices.add(new Choice(59, 2, "2. 回到工作位上静一静", 12));

        choices.add(new Choice(60, 1, "1. 冷静一下，现在呆在这很安全，静观其变！", 80));
        choices.add(new Choice(60, 2, "2. 我要把这些告诉我10楼的朋友，这也很重要！你先跑吧，我要上楼", 81));
        choices.add(new Choice(60, 3, "3. 好，一起走", 82));

        choices.add(new Choice(62, 1, "1. 回10楼工作", 12));
        choices.add(new Choice(62, 2, "2. 继续呆着", 82));

        choices.add(new Choice(63, 1, "1. 回10楼工作", 12));
        choices.add(new Choice(63, 2, "2. 继续呆着", 82));

        choices.add(new Choice(64, 1, "1. 回10楼工作", 12));
        choices.add(new Choice(64, 2, "2. 继续呆着", 82));

        choices.add(new Choice(65, 1, "1. 回10楼工作", 12));
        choices.add(new Choice(65, 2, "2. 继续呆着", 82));

        choices.add(new Choice(66, 1, "1. 但呆这很安全啊，不要下去！", 80));
        choices.add(new Choice(66, 2, "2. 好，一起走", 82));

        choices.add(new Choice(67, 1, "1. 继续向下挤", 88));
        choices.add(new Choice(67, 2, "2. 7楼歇一歇脚", 109));

        choices.add(new Choice(68, 1, "1. 下楼，跑！", 83));
        choices.add(new Choice(68, 2, "2. 等同事过来", 84));

        choices.add(new Choice(70, 1, "1. 你TM赶紧离开，我要上去通知我的同事！", 85));
        choices.add(new Choice(70, 2, "2. 抓着他一起跑", 86));

        choices.add(new Choice(71, 1, "1. 回7楼避一避", 67));
        choices.add(new Choice(71, 2, "2. 去6楼避一避", 87));
        choices.add(new Choice(71, 3, "3. 继续向下挤", 88));

        choices.add(new Choice(73, 1, "1. 大叫，一起去救人！", 89));
        choices.add(new Choice(73, 2, "2. 躲起来", 90));

        choices.add(new Choice(74, 1, "1. 挤进去，看看窗外的后续发展", 11));
        choices.add(new Choice(74, 2, "2. 回到工位上", 12));
        choices.add(new Choice(74, 3, "3. 等等他", 91));

        choices.add(new Choice(75, 1, "1. 快跑！", 92));
        choices.add(new Choice(75, 2, "2. 先找障碍物避一避", 93));

        choices.add(new Choice(76, 1, "1. 去9楼找小王", 94));
        choices.add(new Choice(76, 2, "2. 去8楼找小莉", 95));

        choices.add(new Choice(77, 1, "1. 抱着她赶向楼道", 96));
        choices.add(new Choice(77, 2, "2. 抛下她赶向楼道", 97));

        choices.add(new Choice(79, 1, "1. 提醒", 98));
        choices.add(new Choice(79, 2, "2. 不提醒", 99));

        choices.add(new Choice(81, 1, "1. 下楼", 100));

        choices.add(new Choice(82, 1, "1. 先进5楼缓缓", 101));
        choices.add(new Choice(82, 2, "2. 推人，向下开挤", 102));

        choices.add(new Choice(83, 1, "1. 离开他，向下挤去", 88));
        choices.add(new Choice(83, 2, "2. 离开他，去9楼", 103));

        choices.add(new Choice(85, 1, "1. 继续向上挤！", 105));
        choices.add(new Choice(85, 2, "2. 回9楼", 106));

        choices.add(new Choice(86, 1, "1. 继续向下挤", 102));
        choices.add(new Choice(86, 2, "2. 回9楼", 107));
        choices.add(new Choice(86, 3, "3. 进8楼", 108));

        choices.add(new Choice(91, 1, "1. 踢他过去！", 110));
        choices.add(new Choice(91, 2, "2. 快跑", 92));

        choices.add(new Choice(92, 1, "1. 救！", 111));
        choices.add(new Choice(92, 2, "2. 不救！", 112));

        choices.add(new Choice(93, 1, "1. 继续向外挪动", 73));

        choices.add(new Choice(95, 1, "1. 抛下她，下楼逃生", 87));
        choices.add(new Choice(95, 2, "2. 带她去8楼", 113));

        choices.add(new Choice(97, 1, "1. 下楼", 87));

        choices.add(new Choice(98, 2, "1. 去6楼避一避", 87));
        choices.add(new Choice(98, 3, "2. 继续向下挤", 88));

        choices.add(new Choice(99, 1, "1. 去", 70));
        choices.add(new Choice(99, 2, "2. 不去", 71));

        choices.add(new Choice(100, 1, "1. 站在楼道外侧指挥（在办公区内，也就是所谓的最后一人离开关灯之地）", 115));
        choices.add(new Choice(100, 2, "2. 站在楼道内侧指挥（在楼道自动门内）", 116));

        choices.add(new Choice(102, 1, "1. 独自向下", 88));

        choices.add(new Choice(103, 1, "1. 进9楼楼道", 94));

        choices.add(new Choice(104, 1, "1. 继续向下挤", 45));
        choices.add(new Choice(104, 2, "2. 进9楼", 124));

        choices.add(new Choice(105, 1, "1. 向下挤", 88));

        choices.add(new Choice(107, 1, "1. 向下挤", 102));
        choices.add(new Choice(107, 2, "2. 去8楼", 108));

        choices.add(new Choice(108, 1, "1. 独自下楼", 88));
        choices.add(new Choice(108, 2, "2. 无视，带他下楼", 102));
        choices.add(new Choice(108, 3, "3. 等人流缓了带小王进8楼", 117));

        choices.add(new Choice(110, 1, "1. 独自下楼", 118));

        choices.add(new Choice(112, 1, "1. 冲下楼", 104));

        choices.add(new Choice(113, 1, "1. 救你是必然的，做人必须见义勇为", 119));
        choices.add(new Choice(113, 2, "2. 因...因为我一直暗恋你", 120));
        choices.add(new Choice(113, 3, "3. 女...女神，嫁给我好吗", 121));

        choices.add(new Choice(114, 1, "1. 去6楼避一避", 87));
        choices.add(new Choice(114, 2, "2. 继续向下挤", 88));

        choices.add(new Choice(115, 1, "1. 抓紧让同事们撤离", 122));
        choices.add(new Choice(115, 2, "2. 自己跑到楼道内侧", 123));

        choices.add(new Choice(116, 1, "1. 独自下楼跑", 114));
        choices.add(new Choice(116, 2, "2. 不要慌，稳定撤！", 123));

        choices.add(new Choice(118, 1, "1. 回7楼避一避", 125));
        choices.add(new Choice(118, 2, "2. 继续向下挤", 88));

        choices.add(new Choice(119, 1, "1. 不行！这怎么可以，我重说一遍，因...因为我一直暗恋你", 120));
        choices.add(new Choice(119, 2, "2. 我会用生命来保护你", 121));

        choices.add(new Choice(120, 1, "1. 我会用生命来保护你", 121));

        choices.add(new Choice(122, 1, "1. 让他挤出，趁现在自己逃跑下楼", 114));
        choices.add(new Choice(122, 2, "2. 不让他挤出，告诉他大局为重", 126));
        choices.add(new Choice(122, 3, "3. 不让他挤出，告诉他我去救！", 127));

        choices.add(new Choice(123, 1, "1. 让他挤出，趁现在自己逃跑下楼", 114));
        choices.add(new Choice(123, 2, "2. 不让他挤出，告诉他大局为重", 126));
        choices.add(new Choice(123, 3, "3. 不让他挤出，告诉他我去救！", 128));

        choices.add(new Choice(127, 1, "1. 无助", 129));
        return choices;
    }


    private static Map<Integer, String> getConditionContents() {
        Map<Integer, String> conditionContentMap = new HashMap<>();
        conditionContentMap.put(1, "获得奖杯：\uD83C\uDFC6生命的轨迹（命运的齿轮开始转动）\n " +
                "坐上二十五层楼的电梯，来到10楼，这是你平常办公的地方，看了看手表\n" +
                "“CTM，迟到了40分钟！”\n" +
                "“ding，上班啦，打卡成功”\n" +
                "听到自动语音播报的嘲讽，像吃了苍蝇般难受，一整天的心情都毁于一旦，转头向窗口望去，阴暗诡异的天气，真是只有老天才懂我\n" +
                "“活不下去了，要si在代码堆里了”\n" +
                "？\n" +
                "整片楼层的灯光闪烁了一下，在短暂的宁静之后，一些同事骂骂咧咧了起来\n");
        conditionContentMap.put(2, "过了10分钟，没啥事发生，窗外却吵得不行，“乒铃乓啷”让你静不下心，项目仍没干完，一阵尿意又过来了");
        conditionContentMap.put(3, "不出所料的看到一堆车堵着，不然自己也不会迟到...\n" +
                "\n" +
                "这年头，哪个地区不堵车，道路规划局吃饱了撑的在干嘛？\n" +
                "\n");
        conditionContentMap.put(4, "厕所门紧闭着，外头挂了“正在打扫”的字样，这个时间似乎不是她打扫的时候，但你也不会在意一位楼道大妈的正确工作时间");
        conditionContentMap.put(5, "厕所里发出了很重的消毒水的味道，还夹了些清新剂，你忍着这股劲上完了厕所，却发现同事们都对窗外指指点点的，不时还听到钻地的“dongdong”声，有点好奇");
        conditionContentMap.put(6, "获得奖杯：\uD83C\uDFC6工作狂（生命不息，工作不止）\n" +
                "代码终于敲完了，正准备上厕所，窗外却传来了辱骂的声响，同事们都围观了过去，多半又是交通事故吧，事故年年起，今年特别多");
        conditionContentMap.put(7, "走到厕所门口，正巧遇到了楼道大妈，拿下了“正在打扫”的牌子，你感叹时间正好，刚前脚抬入，后脚大妈一下子就冲进了对面女厕？！\n" +
                "\n" +
                "门bang的一声惯性关住，里面发出了惨烈的尖叫声？？！！\n" +
                "\n" +
                "“工...工作也太热情了吧？”\n" +
                "\n" +
                "你惊魂未定");
        conditionContentMap.put(8, "！！！你竟发现有不少人在车顶上跑，有穿着高跟鞋的，有穿着拖鞋的，TM还有穿短裤半赤裸身子的...真是劲道又劲爆啊，港片既视感扑面而来\n" +
                "一旁靠窗的同事也发现了这个情况\n" +
                "“WC碉堡了，靓仔子们啊，看古惑仔啦~”\n" +
                "“诶呀，东西可以乱吃，话可不能乱讲啊，没好货不来看呐”\n" +
                "说着同事雪赵亮了亮自身油光的肌肉，还摆了个健美poss\n" +
                "“不过来么”\n" +
                "“现在是法制社会，你别乱来啊!”\n" +
                "同事志博被“强制”带到了窗边，堵车年年有，这么劲爆的场面不常有，你想叫兄弟们过来看看，但尿也快憋不住了\n");
        conditionContentMap.put(9, "厕所里并未看到大妈的身影，上完了厕所，整个人，身心愉悦了起来，厕所窗口对面连接着大山，空气异常的清新\n" +
                "“啥子味道？”\n" +
                "你似是闻到了一丢丢...腥味？简直是清爽中带有一丝瑕疵啊\n" +
                "“救...”\n" +
                "轻微的听到有人在低鸣？方向来自厕所的深处，那最后一个死死紧闭着门的坑位\n");
        conditionContentMap.put(10, "你走向了9楼的厕所，9楼也是你常来的地方，是前后端联调的重地，你与9楼的某些后端同事也算是称兄道弟的好哥们，如小王，那可是比10楼同部门的前端组好相处多了，至少他们不懂你的代码，不是吗？\n" +
                "\n" +
                "上完厕所，拿起手机就想找小王唠会嗑，却发现没信号...");
        conditionContentMap.put(11, "到你走过去时，看窗户的人已被压得满满当当，拉不开一丝的缝隙，甚至还有些人站在了工作台上观看\n" +
                "“天呐”、“我C”...\n" +
                "听着同事们辱骂的感叹词，你从心底感受到一些不安，于是你也一同爬到座位上，向远方眺望。\n" +
                "——\n" +
                "我C！你看到了什么？你看到了N多持枪械的特种兵（？）正站在武装车顶上进行着射击，射击着...眼睛向着扫射线路望去，平民？！射击那些毫无还手之力的平民？你真的不敢相信自己的眼睛，这TM真的是黑道吗？\n" +
                "内心震惊不已\n" +
                "“tatata”，随之而来的，就是楼上繁杂无规律的脚步声，像是大规模移动迁徙，说是移动，更像是在逃窜\n");
        conditionContentMap.put(12, "回到座位上，看见原完好无损的窗户上，出现了几个小孔，那可是防爆玻璃呢，质量那么烂？花瓶倒翻了几盆\n" +
                "你看着越来越多的人挤进那几个仅有的窗户，像是中了毒般的去吸取新鲜空气，还不时的发出侮辱性的叹词\n" +
                "“tatata”，楼上也传来了琐碎杂乱的脚步声，像是在逃窜，突然有人大喊\n" +
                "“这TM还工作个P啊，跑路啊！”\n" +
                "随着这声响的尘埃落定，终于鼓动了大批的同事，他们也开始整理吃饭的家伙\n" +
                "“嗖嗖嗖嗖”\n" +
                "一时间，像菜市场一样热闹起来，窗边的人开始缓缓离开溜之大吉，有些人脸上还神情呆滞，恍若隔世。\n");
        conditionContentMap.put(13, "一眨眼时间，窗户竟已人山人海，你是真的挤不进去了，同事们相互推嚷着，差点把你的尿给挤出来，平时和和睦睦的他们去哪儿了？诶，时过境迁，老了，老了啊，你感叹着岁月蹉跎走向厕所");
        conditionContentMap.put(14, "还没进厕所，就感受到了不寻常的味道，有臭味、消毒水味，还有清新剂的味道，非常奇怪又偶然的交杂在一起，谁也没覆盖了谁，这味道甚至让你有些恶心\n" +
                "\n");
        conditionContentMap.put(15, "你嚷着让周边的朋友、同事来看，其他人也开始呼吁起周边的人，窗边开始了叠罗汉，一层又一层让你美滋滋的透不过气，膀胱有种放了C4的感觉\n" +
                "\n" +
                "窗外警车开过来了！武警，特警都有，眼尖的你甚至还看到了大老远开过来的救护车，上面那是什么标志，生化标志？");
        conditionContentMap.put(16, "虽然错过了有点可惜，但你觉得还是上厕所比较要紧，你走向了同层楼的厕所\n" +
                "厕所里有一股怪怪的味道，说不上来，特别是女厕里还发出了“galagala”的声响，让你有些毛骨悚然，你快速的解决了个人问题后，离开了厕所，掏出了手机，意外的发现没了信号，手机屏反射的光，看到对面女厕的门开了\n" +
                "\n");
        conditionContentMap.put(17, "你心想，没什么大不了的，便自己给自己壮胆走进了男厕，方便了之后，回头看了眼紧闭着的女厕，里面没有了声音\n" +
                "\n" +
                "也许是错觉，但回想起来总有些后怕，有种幸好没进女厕的感觉\n" +
                "\n" +
                "但很显然女厕是有女同事的，万一这是真的，大妈是癫痫，狂躁症之类的发作，我真的不管不顾吗？");
        conditionContentMap.put(18, "获得奖杯：\uD83C\uDFC6“一世英名”（听说开启的不是一般人）\n" +
                "你鼓起勇气上前敲门\n" +
                "“咚咚咚”\n" +
                "“有人吗，需要帮忙吗？”\n" +
                "“...”\n" +
                "没人回应\n" +
                "里面断断续续传出的“galagala”声响让你心跳加速，你最终还是打开了门\n" +
                "“zhi”——\n" +
                "随着门把手被你拉开\n" +
                "！！！\n" +
                "猛地，一只血红的细手抓到了门框，心跳骤停一秒\n" +
                "那是只血手！你被吓得一屁股坐到地上，裆间刹那湿湿润润，一世英名算是凉了，这只手没出来，似乎被什么东西疯狂的拉扯着，颤抖的血手忽上忽下，木质的门框被指关节抓的快凹陷，木屑刺进了她指尖毫无感应！\n" +
                "“救命救命救命！”\n" +
                "\n");
        conditionContentMap.put(19, "你向最后一个坑位缓慢走过去\n" +
                "“疯了，都疯了，孙子小胖不吃饭了，领导咬人了，大姐那饭菜晚上拿不过去了...”\n" +
                "紧闭的坑位传出碎碎念的话语\n" +
                "“阿姨，发生什么事了？”\n" +
                "“完了，都完了，日本鬼子攻进来了”\n" +
                "牛头不对马嘴，话音未落，长达5s+的呕吐声发出，让你的胃也翻滚起来，头皮发麻，滴滴答答，声音由重至轻，些许溅到了台阶外头，黑色的！\n" +
                "\n");
        conditionContentMap.put(21, "你来到9楼小王的办公区域，旁边净是叽叽喳喳声在聊什么“病毒”、“生化”之类的话题，如要说“Vue、React”之类的话语，我倒是能旁听或解答一二，但这些是真的一点想法都没，存在于电影小说内的东西在现实扯个鸡毛蛋。\n" +
                "走到小王座位上，意外的发现小王趴在玻璃窗上眺望\n" +
                "“小王，小王，嘿你TM的，叫你呢”\n" +
                "“啊...哦，我在听”\n" +
                "\n");
        conditionContentMap.put(23, "你刚说完几个字，“砰砰砰砰”几颗圆孔展现在玻璃的表面，一股淡淡的火药味在空中盘旋，肉眼可见的在空气中留下一道淡淡的灰白色轨迹，在另一面墙壁上留下几个深深的弹孔，这下，再说不知道这是什么，都是自欺欺人啊。\n" +
                "“啊！！！”\n" +
                "同事们都慌乱了起来，整个办公地犹如菜场一般吵闹的如火如荼，玻璃裂痕有扩张的姿态，楼上楼下都震动了起来\n" +
                "猛地，七八架直升机突兀的出现在窗外盘旋，这TM要上天！\n" +
                "你跑到座位上，片刻的时间让你思索\n");
        conditionContentMap.put(24, "话音刚落，不少同事也开始起哄逃跑，心里越来越慌，不少的磕磕碰碰事件发生，你也随着人流被挤到了楼道口，顾不得拿吃饭的家伙了！\n" +
                "“bang！！！”\n" +
                "震耳欲聋的爆炸声让你回头\n" +
                "你看到了大片防爆玻璃窗整块整块的应身倒下，我真TM机制啊，再回过头，楼道已人满为患，电梯停止运作，二十五层楼，一层楼近百人的挤应急通道，下去就是没半条命\n" +
                "“TM大家注意踩踏事件啊！”\n");
        conditionContentMap.put(25, "你没有招呼大家，也许这种时候更体现人类自私的一面吧，你回头看了眼座位上的背包，里面有女神小莉的照片，在上次团建时候偷拍的，是你YY的对象");
        conditionContentMap.put(27, "获得奖杯：\uD83C\uDFC6First Blood（嗯？游戏结束了吗）\n" +
                "靠近玻璃窗，几声闷响振聋发聩，啪啦啪啦，防爆玻璃碎一地，随着耳鸣阵阵，你看到周围的同事四处逃窜，不可置信的表情铺满一张张的脸颊，有的带有庆幸，有的带有悲悯\n" +
                "\n" +
                "你...倒在地上，晕了过去\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(28, "获得奖杯：\uD83C\uDFC6First Blood（嗯？游戏结束了吗）\n" +
                "你强忍着这股劲打开了这扇门，味道的发源地让你不想走到深处，随意打开第二个坑位，门也来不及关，刚脱下裤腰带，准备解决生理需求时，突听到“滴答滴答”的声响\n" +
                "...\n" +
                "有人进来了，步伐像是施工的老大爷，像是保洁的张大妈，拧着未干的拖把...\n" +
                "——\n" +
                "death\n" +
                "——\n");
        conditionContentMap.put(29, "获得奖杯：\uD83C\uDFC6憋尿大圣（古有大圣西天取经，今有大圣憋尿自尽）\n" +
                "刺激性的味道压抑的让你难受，种种奇奇怪怪的事无时无刻不在挑战你的神经，你跑向了楼道，竟发现楼道已人山人海，你不知道发生了啥，也不想关心，因为现在你只想解决生理问题");
        conditionContentMap.put(30, "下面的人越来越多，竟围着武警大队冲了过去，民族起义？恐怖袭击？远处飞来了几架武警直升战斗机！场面真TM壮观\n" +
                "“tututu”\n" +
                "95式突击步枪毫无章法的扫射起来！打破了楼下食堂，打碎了水果店的门窗\n" +
                "空调仍在运转，而你却感受不到一丝舒爽，心悸带来的冰凉在后背、手心，还有裆部直冒\n" +
                "“快跑啊，再呆着有危险啊！”\n" +
                "终于有人缓过神，急促道，场面开始混乱...\n");
        conditionContentMap.put(31, "厕所的味道非常非常的刺鼻，浓厚，恶心！一周的时间，厕所能成这副德行？真不知保洁员们怎么工作的，你强忍，随便找了个坑位关门\n" +
                "“爽！西湖的水~我的...”\n" +
                "边洒，边想着一天发生的种种怪事\n" +
                "“不对啊，不靠谱啊...”\n" +
                "心跳略微加速，有些不祥念头伸手却从指缝溜走，抓不住，头上像是顶了片乌云，非常压抑。\n" +
                "抖了抖，抬腿准备离开，厕所窗外传来阵阵怪叫\n" +
                "\n");
        conditionContentMap.put(34, "你鼓起勇气，上前敲了敲门，无人回应\n" +
                "\n" +
                "“有人在吗，需要帮忙吗？”\n" +
                "\n" +
                "...");
        conditionContentMap.put(35, "你最终还是离开了此地，突发现同事们都对窗外指指点点，不时还听到钻地的“dongdong”声，有些好奇\n" +
                "\n");
        conditionContentMap.put(36, "获得奖杯：\uD83C\uDFC6女神到我怀（开启隐藏支线）\n" +
                "你鼓起勇气一脚踢开了女厕所的门，双手抓住她胳膊，与对方拉扯作着斗争\n" +
                "“MD力气还不小”\n" +
                "眼神一眯，猛一用劲，成了，对方横向僵直得扑进你怀里，惯性的力道还把你撞到身后的瓷砖上，肾疼，你甚至来不及看清女厕有什么，女厕的门因反作用力过猛又被关上了\n" +
                "...\n" +
                "“嗯？这胸前的柔软，是...是小莉！”\n" +
                "虽双手、衣裤上沾染着鲜血，杂乱的头发卷曲着，但浅蓝色的连衣裙与她最爱穿的平底鞋让你一眼就道出了她的身份，最重要的还是因为她是你的女神，emm...也是公司的女神，平时冷漠性冷淡的样子，但情商智商却非常的高，周边关系处理的一片融洽，高不可攀但又像邻家小妹，可以YY但也没任何人能夺取她芳心，要是同事知道他们的女神现在抱在我怀里，明天太阳我是见不到了。你慌不择言，手脚忙乱一阵后发现她毫无反应\n" +
                "“小莉？”\n" +
                "“...”\n" +
                "看样子是昏迷了\n" +
                "\n");
        conditionContentMap.put(38, "获得奖杯：\uD83C\uDFC6First Blood（嗯？游戏结束了吗）\n" +
                "“emm...大妈你能讲清楚些吗？”\n" +
                "\n" +
                "...\n" +
                "\n" +
                "没回应，你慢步走了过去，在整片沉寂，压抑下的空间，脚步声显得尤为突兀刺耳\n" +
                "\n" +
                "“zhi ~”\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(39, "走出男厕，一位男同事也进来方便，背对着他，擦肩而过，你心跳频率突然加快，不知道为何整个人都敏感了起来，是我想太多了吗？\n" +
                "\n" +
                "厕所洗手台位于男厕与女厕的中间，除了一旁的半身镜，也还有一个百叶窗\n" +
                "\n" +
                "窗外发出阵阵声响");
        conditionContentMap.put(40, "你与小王讲了厕所的种种怪事\n" +
                "\n" +
                "“你不要吓我啊，大白天闹这种笑话一点都不好笑”\n" +
                "\n" +
                "小王看了看窗外的人群又看了看你");
        conditionContentMap.put(41, "“迟到很正常啊，我早上也迟到了40分钟”");
        conditionContentMap.put(42, "“啊？这也太大惊小怪了吧，我们这也闪了，可能整幢楼都闪了吧”");
        conditionContentMap.put(43, "“我手机没信号了，不知为啥，还刚买的呢”\n" +
                "\n" +
                "“...你买的太差了呗，以后听我的”");
        conditionContentMap.put(44, "你挤着人群冲了上去，像极了鲤鱼跃龙门\n" +
                "\n" +
                "...\n" +
                "\n" +
                "不行！挤不上\n" +
                "\n" +
                "人流像湍急的河水飞流直下，你又被挤了下来，险些造成踩踏事故");
        conditionContentMap.put(45, "你奋力的挤着人群，像极了日本地铁助推员\n" +
                "\n" +
                "好一会儿，终是挤到8楼墙角，有了片刻的喘息，你想起了9楼好兄弟小王不知能否出来，看这层层人流都往外挤，你是没什么机会进了\n" +
                "\n" +
                "“别挤了，别挤了”\n" +
                "\n" +
                "“说你呢，停着不动干嘛，下去啊！”\n" +
                "\n" +
                "嚷着，骂着，你又被挤了下去");
        conditionContentMap.put(46, "“什么啊，是小马啊，没什么事儿，瞧把你怕的”\n" +
                "他没把你的话放心上，而你也没再去阻止，毕竟万一没啥事，自个儿还会成为笑料被同事们扯上一年呢\n" +
                "...\n" +
                "过了几分钟没见什么事发生，你也安下心来\n" +
                "离开回到10楼，发现同事们都对窗外指指点点的，不时还听到钻地的“dongdong”声\n" +
                "\n");
        conditionContentMap.put(47, "人实在是太多了，你怀疑挤进去都会成为肉饼，就算不变肉饼，到楼道中也会活活憋死，但现在的情况却是你不动，人也会往你这冲，于是你又只好奋力往外挤，与大批人挤楼道产生了鲜明的对比\n" +
                "“galagala”\n" +
                "什么声音？你退后了几步，看到了几位姿势怪异的人（？）从厕所走出，鞠缕半身，头发散乱看不清脸颊，而你一旁的女同事伸头望去便大叫\n" +
                "“快过来啊，小莉”\n" +
                "“卧槽，那样子是女神小莉？”\n" +
                "“...”\n" +
                "对方没回应，你旁边的女同事也推开了周边的人群，向小莉跑去\n" +
                "你正好也看到了与小莉更后面的同事小张，他还在仔细整理他的包裹，正巧与你四目相对，向你挥了挥手大喊道\n" +
                "“人太多了，等会再下去！”\n" +
                "\n");
        conditionContentMap.put(48, "你没有拿背包，出现这种情况更应该轻身上阵，你没有告知同伴们，飞快的跑到了楼道口，但楼道口却已人满为患\n" +
                "“有这样想法的人还真不止我一个”\n" +
                "“beng！！！”\n" +
                "身后传来震耳欲聋的声音，紧接着就是玻璃渣滓碎一地的声音，整层楼彻底慌乱了！越来越多的人往楼道口挤进，虽然人群拥堵，但你还是为了自己的机智而舒了一口气，因为你已挤到了楼梯中\n" +
                "到9楼，你看了看还不算拥堵的9楼楼道口\n" +
                "\n");
        conditionContentMap.put(49, "你拿起背包就往外跑，并未怎么收拾\n" +
                "\n" +
                "“beng！！！”\n" +
                "\n" +
                "这TM是大炮的声音？市中央有坦克？\n" +
                "\n" +
                "震耳发聩，耳鸣阵阵，防爆玻璃全部爆炸，墙上突兀斑斑裂痕，你被狠狠得摔倒在地上\n" +
                "\n" +
                "“CTMD”\n" +
                "\n" +
                "此时\n" +
                "\n" +
                "厕所走出四五位姿态怪异的人，披肩散发看不清面容，渗的发慌\n" +
                "\n");
        conditionContentMap.put(50, "人实在是挤的不行，膀胱也是急的不行，终是在你身心近奔溃的情况下，磕头碰脑跑进了9楼\n" +
                "\n" +
                "漏尿了，漏尿了！\n" +
                "\n" +
                "周边人被你七推八阻的传来阵阵白眼，不过你根本不会在意，跑进了9楼厕所\n" +
                "\n" +
                "——\n" +
                "\n" +
                "【结局A】\n" +
                "\n" +
                "——");
        conditionContentMap.put(51, "你实在憋不住了，推开向楼道处跑的人群，回到男厕，忍着这股难闻的劲打开了门，而此同时，背后微微一凉\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(52, "你抬眼望去，大门涌出了批量的人四散而逃，竟还不少人在相互撕咬，殴打？这预感让你很不好受，虽是极力避免的往那想，但这一幕真TM像《生化危机》啊...\n" +
                "身临其境的感触让你觉得很不真实\n" +
                "空气，味道...\n" +
                "“zhi ~”\n" +
                "男厕的门开了，而你竟不自觉的憋住了呼吸，甚至不发出一丝声响...\n" +
                "——\n" +
                "【结局B】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(53, "你离开男厕，走在厕所走廊上，余光瞥见女厕的门开了，有个身影走向男厕，你心跳更是加快了许多\n" +
                "“小马，怎么了，被外面的场景给吓蒙了？”\n" +
                "“哪...有，笑话”\n" +
                "原来是小辉，平常你就与他不太对付，整日写着自解释的函数式代码，认为让别人看不懂的才是最牛B的\n" +
                "“哦，哥跟你讲，哥刚写的vscode插件下载量破1W了呢，还有那github的star也快...”\n" +
                "边说边准备去上厕所，真不知道是自言自语，还是耀武扬威的吹嘘，擦肩而过之时，你\n" +
                "\n");
        conditionContentMap.put(54, "你鼓起勇气，手放到了门把上，还未用力\n" +
                "\n" +
                "门开了，但不是你开的？\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(55, "你就近取材，取了些水打湿了自己的手腕，拍打在小莉的脸上，小莉醒了，朦胧的双眼突然惊目圆睁，抬手指着你背后\n" +
                "\n" +
                "“咋了，咋了，发生啥事了？”\n" +
                "\n" +
                "“啊！！！”\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(57, "你迅速抱起她，回到座位上，看向周旁\n" +
                "“还好，他们注意力都不在这”\n" +
                "一堆人向窗外使个劲的拍照，懵然不知，回头就看到小莉猛一睁眼，吓得你一阵发颤\n" +
                "“你真是吓死我了！”\n" +
                "“丧，活！有丧...”\n" +
                "“什么？”\n" +
                "血红的双手，脏乱的脸颊，不整的衣冠，纷纷都透露出一股不祥的征兆，她本是个冷静的人，说天塌下来她面色不变也不会过，是遇到了什么事能让她变成这样？\n" +
                "“不要急！慢慢说”\n" +
                "“有，有丧尸！”\n" +
                "她抬手指向女厕所，正巧不巧，女厕所的门开了\n" +
                "这场景，这逼真的感觉，吓得快让你无法呼吸\n" +
                "\n");
        conditionContentMap.put(58, "你抬眼望去，大量的人群四散而逃，门口堵得水泄不通，位于第10层楼的你丝毫感觉不到一点能跑出去的希望，远处还有不少人在相互撕咬，这种预感让你很不好受，虽是极力避免的往那边想，但这一幕实在是委实像极《生化危机》...\n" +
                "身临其境的感触让你觉得很不真实\n" +
                "空气，味道，甚至心跳体温表情...\n" +
                "不知过了几分钟有余，却还是不见同事出来，不详的预感笼上心头\n" +
                "“啊！！！”\n" +
                "男厕猛地一阵惨叫，你鸡皮疙瘩瞬间起来，与其说刚是你有意没提醒他，倒不如说是自己心底否认了这种情况的发生，但看完厕所窗外后，你有些后悔...\n" +
                "\n");
        conditionContentMap.put(59, "你对你刚才的行为感觉到一丝的心悸与歉意，还是有意的等了一会，见没发生什么事，稍稍放下心来\n" +
                "\n" +
                "你离开了厕所走廊，却发现同事们都对窗外指指点点的，你不由得好奇");
        conditionContentMap.put(60, "“我手机没信号了，不知为啥，还刚买的呢”\n" +
                "小王看了看自己手机\n" +
                "“不是吧，是不是你手机太烂了？...我也没信号了？小玲，你手机有信号吗，也没了？不是吧，又没连wifi，大规模的断信号，网也没了，基站都跪了？”\n" +
                "小王来回徒步了几圈\n" +
                "“小马你先跟我看看窗外，下面暴动份子行为举止很是怪异”\n" +
                "话音刚落，玻璃窗外“bengbengbeng！”的声音传出\n" +
                "“99改跟05两栖突击坦克？！”小王拉着我惊道，震撼的尖叫像公鸭嗓\n" +
                "“wtf！远处飞的那是武直20吧，这是两国交战才会出机密直升机啊，还来了六七架！”\n" +
                "小王父亲是铁铮铮的军人，让他打小就成了军事迷，但因生性自由，不爱束缚，没走他父亲的老路\n" +
                "“不要呆这了！咋们赶紧走，基站靠直线传播，我知道附近的两站，最近的估计断了，我们去远些的，新闻上一定播报了我们所不知道的重大信息，这很重要！”\n" +
                "\n");
        conditionContentMap.put(62, "“啊？我们这灯光也闪了，可能整幢楼都闪了吧”\n" +
                "\n" +
                "小王并没有放在心上，贴在窗外看着人群的一举一动");
        conditionContentMap.put(63, "“嗯？手机没信号了，你买的太烂了吧~ 以后买什么牌子，什么型号听我的”\n" +
                "\n" +
                "小王并没有放在心上，贴在窗外看着人群的一举一动");
        conditionContentMap.put(64, "“我也迟到了40分钟啊，你看外面这堵的，估计大伙都迟到了”\n" +
                "\n" +
                "小王并没有放在心上，贴在窗外看着人群的一举一动");
        conditionContentMap.put(65, "“emm...这玩笑一点也不好笑”\n" +
                "\n" +
                "小王回头看了看你，继续看向窗外");
        conditionContentMap.put(66, "“你这笑话一点都不好笑！”\n" +
                "小王继续看向窗外\n" +
                "“WC，别吓我啊，不...不会是...吧”\n" +
                "小王呼吸不畅，胸腔此起彼伏，大叫一声后，声音低了下去\n" +
                "小王掏出手机\n" +
                "“我去，真没信号了？小玲，你手机有信号没，也没了？不是吧，又没连wifi，网TM也没了，大规模断信号，基站都跪了？”\n" +
                "小王真的不淡定了，来回徒步，又看了看窗外\n" +
                "“我有一种不祥的预感，你最好不要去楼上了，咋们直接走吧”\n" +
                "“去哪儿？”\n" +
                "“去有信号的地方，我知道附近哪儿有，我们不能做聋子与哑巴，需要知道最近日况！”\n" +
                "听着头头是道，你也安下了上楼的心思\n" +
                "\n");
        conditionContentMap.put(67, "你挤到7楼，沉闷的气味快让你窒息，楼道人满为患，几乎无法再往下挤，更无法回头，你心跳加速，有些不安，不知来源是楼上，又还是楼下\n" +
                "\n" +
                "“TMD楼下是发生啥事了，莫非1楼门口还被封住了不成？”\n" +
                "\n" +
                "有人骂道");
        conditionContentMap.put(68, "你大叫一声，片刻盖过了四周杂乱无章的声响，那几位怪异的人齐齐向你转了过来，头部以下部位却未动...\n" +
                "“wtf”\n" +
                "他们向你走来，似有愈走愈快之势！\n" +
                "你旁边的女同事见“小莉”过来，便没在意回过了头\n" +
                "“不是吧！”\n" +
                "你下身像灌了铅一般的挪不开步，但此间也让你看清了诡异人其一，那是楼道的清洁大妈！她脸角血肉模糊，右肢分明是骨折之后向外翻的状态，鲜血流干，红褐色粘在衣服上，白的黑的黄的，还看到了些许骨头！\n" +
                "omg，常人这样早应该尖叫的向他人求救了吧？他们竟还未察觉一般，一看就有鬼啊！\n" +
                "这样诡异的情况，给你带来了名叫“未知”的恐怖\n" +
                "“傻站着不看眼睛啊？”\n" +
                "同事雪赵雄伟宽厚的肩膀撞了一下你，你没怪他，因为身体终是有些知觉了\n" +
                "\n");
        conditionContentMap.put(69, "你没有对“奇装怪异”的他们感到异样，可能是在厕所被外面的震动吓坏了也未可知\n" +
                "\n" +
                "你离目的地近了\n" +
                "\n" +
                "离他们也更近了...\n" +
                "\n" +
                "“啊！”\n" +
                "\n" +
                "擦肩一瞬，他们猛地向你扑来...你突兀着双眼看着同事们惊吓的表情四散而逃，无人向你伸之援手，意识渐渐消散了\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(70, "你冲进9楼办公层，一眼望去9楼尽是杂乱无章，杯盘狼藉，有的净是窗框外飘进的呛鼻烟硝，乌烟瘴气\n" +
                "你推开向楼道奔跑的人群，赶向办公区域，看到小王了！他趴在玻璃上，神情恍惚，恍若隔世\n" +
                "“小王，小王，赶紧跑，有危险！”\n" +
                "“是，是丧，是尸，对了，我是不是还在做梦？小马你打下我”\n" +
                "“CAO，你在说什么啊！”\n" +
                "小王手舞足蹈一翻，看来是无法跟他正常沟通了，便立即抓住了他的衣角\n" +
                "“一起下楼！”\n" +
                "“beng！！！”\n" +
                "楼房一阵颤动，不少人摔倒在地\n" +
                "“是坦，坦克！政府采用了极端政策，消灭一切病原感染体！”\n" +
                "你好像是在听他讲天书，但一阵内疚感从心而来，如果是真的，楼上的同事们怎么办，我独自逃跑真的好吗\n" +
                "\n");
        conditionContentMap.put(71, "虽然有些自我安慰，但还是觉得小王那么聪明，一定会先跑的！你不再看9楼楼道，向8楼挤了下去\n" +
                "简直是一楼更比一楼堵，你被堵在7楼与6楼的楼梯之间竟无法挪动上下\n" +
                "“有...有鬼啊，要命啊”\n" +
                "“有活尸啊”\n" +
                "“丧尸啊，丧尸”\n" +
                "一些人嚷着叫着从楼梯下传来，震耳欲聋，煞有其事般在楼梯中阵阵回响\n" +
                "“别挤了，要命了啊，大家都在下去，你们还上来，有病啊？”\n" +
                "“CTMD，楼下有丧尸啊，我不管，我要上去！”\n" +
                "“我...我也要上去！”\n" +
                "辱骂声不断，尖叫声不断，真的是一个头两个大，到底去哪儿！\n" +
                "\n");
        conditionContentMap.put(73, "“是小莉吗？赶紧过来呀，...你咋不过来？”\n" +
                "一位女同事似是认出了其一的身份，歪着头向着“诡异”的几人走去\n" +
                "而你耳朵也竖了起来，小莉女神？\n" +
                "“啊！”\n" +
                "那位“小莉”女神猛地向那位女同事扑去，咬到了肩胛骨，另几位也扑了过去，场景极度血腥，咬断锁骨，吸食骨髓\n" +
                "“救我救我！”\n" +
                "女同事推打着“小莉”，对方丝毫无离开的想法，右侧肩膀大动脉被咬破，血液喷薄而出，血洒满地，尖叫声震耳欲聋，不少人当场吓懵\n" +
                "\n");
        conditionContentMap.put(74, "你心理暗示着“这没事，并没有什么大不了的，一切都会好的”\n" +
                "\n" +
                "这时，楼道外另一侧的窗户趴满了人群，争先恐后般指手画脚");
        conditionContentMap.put(75, "获得奖杯：\uD83C\uDFC6不怕神对手，就怕猪队友（开启隐藏支线）\n" +
                "“不要过去！”\n" +
                "声音非常的小声，怕重了会出现什么事故，头也没转的叫道\n" +
                "“干嘛这么神秘兮兮？”\n" +
                "小辉一愣，声音大声了起来，像是瞧不起你一般\n" +
                "“难道还会发生比刚窗外面更震撼的事情来吗？！”\n" +
                "“zhi ~”\n" +
                "女厕，男厕门同时被打开了，扑面而来一股腥臭，里面还发出了嘶哑的叫声...\n" +
                "小辉浑然不在意，走向男厕\n" +
                "“真TM臭啊，你小子是拉外头了吗”\n" +
                "靠近了，小辉离男厕越发的靠近，而你却越发的往后退\n" +
                "“呀呀呀！！！”\n" +
                "小辉脚底滑了半跤愣是没滑倒，上下半身扭了个麻花，裤裆间湿了一大片\n" +
                "“有鬼啊！”\n" +
                "果不其然！男女厕所跑走出两只诡异的人，长发遮住了前半身，右脑勺竟裸露出白花花的东西，身上红的黑的白的一块块\n" +
                "“啊！”\n" +
                "它们双手与肩顿时平齐，张牙舞爪向你们跑来！\n" +
                "\n");
        conditionContentMap.put(76, "“放我下来，我能走了，放我下来！”\n" +
                "你放下了她，两人赶到了楼道口\n" +
                "“啊！鬼啊，鬼啊”\n" +
                "后方有人大叫，顿时楼层乱成了一锅粥，有更多的人挤向了楼道，小小门被堵得不可开交，你似乎明白“后面”在发生着什么...但幸运的是，你们已被挤到了楼梯间\n" +
                "“拉着我的手！”\n" +
                "你叫道，不给小莉反应机会抓住了她，拥堵的人群缓慢移动，你有心挤但因多带了个她，没法加快速度\n" +
                "挤到9楼，顿时想起了你的好哥们小王在此处办公，他可是个军事迷呢，有他在，无疑会安全很多\n" +
                "突然，你与小莉被人群挤散，一眨眼想的功夫，她竟被挤下8楼\n" +
                "\n");
        conditionContentMap.put(77, "你大声提醒危险，顿时不少人被你吸引了目光，惊慌失措\n" +
                "\n" +
                "紧接着就发生了“大暴乱”人们四散而逃，涌向了楼道口，堵得水泄不通\n" +
                "\n" +
                "而同时厕所处出来几个诡异的人\n" +
                "\n");
        conditionContentMap.put(78, "你冲进了男厕，因惯性带上了后面的大门，眼前一条血迹从你脚下直至最后一个坑位\n" +
                "\n" +
                "“beng”\n" +
                "\n" +
                "后方男厕的门被关上了，发出了重重的声响\n" +
                "\n" +
                "“zhi ~”\n" +
                "\n" +
                "又被打开了？\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(79, "你冲到了办公区，眼角带过一丝歉意，你怀疑自己这么做会不会有些泯灭人性，你回头看了看还趴在窗上的人们\n" +
                "\n" +
                "要不要提醒？");
        conditionContentMap.put(80, "小王犹豫的看了看你，最终决定陪你先等一会\n" +
                "“beng！”\n" +
                "开炮的方位是这边！余波炸碎了整片9层玻璃，耳鸣不止，你与小王还有周边的同事被弹片、玻璃碎片炸伤，晕了过去\n" +
                "...\n" +
                "不知过了多久，你终于清醒了些，手脚也恢复了知觉，却因失血过多，导致头晕眼花，四肢无力，朦胧的双眼似看到什么东西飞奔而来\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(81, "获得奖杯：\uD83C\uDFC6圣母玛利亚（开启隐藏支线）\n" +
                "“那行，我尊重你的选择，我们在‘岐那街25号’集合，你一定要过来啊！”\n" +
                "说着，小王向楼梯下跑去，而你同时冲向了10楼\n" +
                "赶到10楼\n" +
                "“兄弟们，听我说！”\n" +
                "你大吼一声，声响盖过了片刻的吵闹，同事们纷纷侧目，你将小王的建议告知了大家，大家犹如看到了主心骨一般，点头附喝\n" +
                "“一起到‘岐那街’去！”\n" +
                "\n" +
                "作者：清一色天空\n" +
                "链接：https://juejin.im/post/5d19c13d518825597909b960\n" +
                "来源：掘金\n" +
                "著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。");
        conditionContentMap.put(82, "话不多说，你点头默认，此时楼道虽也有人，但还不算拥堵，你们加快脚程，三步并两步的赶下楼\n" +
                "“beng！”\n" +
                "楼道一阵颤动，撒了一众灰尘，好在楼层牢固，没出现什么安全隐患，此时抬眼望去已到5楼，但在震响之后，4、3楼已然门庭若市、人满为患，楼上6、7楼更是骈肩累迹、摩肩接踵，当下情况成了进无可进、退无可退的尴尬情况\n" +
                "...\n" +
                "“怎么人流还没动，想不想下去了？”\n" +
                "楼梯中吵闹得不可开交，5分钟过去了，楼梯上的人群竟然是丝毫未动？\n" +
                "大批量的人群挤在楼道中，让你有些供氧不足，一些性子急的人更有拳打脚踢之势\n" +
                "此时，你有了些想法，看了眼小王，小王表示听你的\n" +
                "\n");
        conditionContentMap.put(83, "人最怕什么？最怕“未知”\n" +
                "眼前一幕让你毛骨悚然，鸡皮疙瘩落一地，一种“求生”的本能一触即发\n" +
                "“让开！让开！”\n" +
                "你推开楼道人群，挤进了楼梯，在人群环抱之中好似能得到一些安全感\n" +
                "“什么鬼？啊！”\n" +
                "“这是什么啊，丧尸吗？”\n" +
                "“小莉，啊！”\n" +
                "最后一声自然是那位女同事，她自始至终未能察觉到危险，转头时，已被啃咬在地\n" +
                "“咔咔咔”\n" +
                "阵阵啃咬声逐渐变成吸吮声，像用手在泡菜中反复搅拌，头皮发麻\n" +
                "乱了，后面彻底的乱了，本就拥挤的楼道更是拥堵不堪，前也不能前，后也不能后！\n" +
                "你向人群之后看去\n" +
                "有人逃跑，有人奋起抵抗，同事雪赵在踢腿时，却被它小腿咬伤，你不知道这东西会不会感染，又是靠什么传染的，但很显然小莉本不是这样的\n" +
                "那位健壮的男同事雪赵踢开了它，本着壮健的身姿与强悍的力道，挤开人群，来到楼梯中，与你相隔不远\n" +
                "\n");
        conditionContentMap.put(84, "你强忍着恐惧，镇定下来，同事却不敢往你这边跑，你正准备再吼一句时，那几位怪异的人猛地扑向了周边的人，那女同事也应身倒下，你看着这一幕脚开始不听使唤，你努力转回头，不去看，迈开缓慢的步伐走向人群拥堵的楼道，他们都惊恐的看着你，有些四散而逃，有些更往里边去挤，你冷汗滑落至手心，不敢回头...\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(85, "你跑回了楼道，正准备上楼，却发现一眨眼的功夫，楼道里竟人满为患，逆流而上本就困难，狭小的楼道更是让你呼吸不畅，你努力的挤了进去，终是挤到10楼楼道口，猛地，上面像是加大力度一般，向下推嚷，让你回到了9楼与10楼之间\n" +
                "刚才，在10楼楼道口的刹那，你看到有很多同事都没意识到！你好心想上去提醒，但11楼乃至25层楼的人流加大，让你有些望而却步，你犹豫了起来\n" +
                "\n");
        conditionContentMap.put(86, "你拉上了恍惚中的小王，跑向9楼楼道口，此时的楼道口人满为患，你一咬牙，下定决心挤了下去，终是挤到8楼，再也挤不下去，你看了看楼下的楼道间隙，竟是还有人往上赶？这TM如何下得去？");
        conditionContentMap.put(87, "你冲进6楼，大口呼吸着新鲜空气，有种劫后余生之感，在楼道口实在是太闷热了\n" +
                "你刷卡走进办公区，自动门缓缓关上，一眼望去，里面空旷之极，没有人员的存在，是了，毕竟6楼也算是低层楼，遇到突发状况，应是都跑了\n" +
                "“beng！”\n" +
                "又是一阵巨响，楼层晃荡，头上灯管纷纷砸落，你正头顶大型中央空调砸了下来...\n" +
                "——\n" +
                "【结局D】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(88, "你终是挤到了5楼，而此处最是尴尬，有人向上冲，有人向下挤，你实在是无法挪动半分\n" +
                "此时，也不知谁抓了一下你，皮开肉绽，鲜血直流，3个爪影在手臂上留下长长血印\n" +
                "惹得你当口就骂\n" +
                "...\n" +
                "不知持续了多久，抬眼望去，挤到了3楼，你虽还被挤着，但脑袋开始昏沉，应是缺氧\n" +
                "“你没事吧？”\n" +
                "耳旁似有人在问，但你有些神志不清\n" +
                "现在没到一楼，抓你的人也还没找到，头发晕，有些迷糊，眼皮像千斤顶，抬不起来，你想先闭上眼，休息会会，再赶路...\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(89, "你冲了上去，一脚踢在“小莉”身上，而“小莉”不闪不避，立即抓住了你的脚，咬在鞋子上，冰凉的触感让你睁大了眼睛，它竟咬穿了鞋子，咬到了脚背还不止！\n" +
                "“来人啊，帮帮忙啊！”\n" +
                "你大吼着，无人来帮\n" +
                "猛地，另一“人”向后抓住了你，咬在了勃颈上，力道之大，让你无法挣脱，随着僵持，你力道渐渐不足，倒在地上...\n" +
                "你看着周围人的表情，似是冷漠，又似是嘲笑，逐渐离去\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(90, "你没有去救她，反而躲到了办公桌底下，对她视而不见，随之传来惨痛的尖叫，绝望的请求，而你无动于衷\n" +
                "你觉得你过去救不了她，是自己太过弱小，怕死，良心受到了一定谴责\n" +
                "尖叫声此起彼伏，像是多数人也遭受袭击，声音越离越远，像是在往楼道赶，而你肚子阵阵痉挛，不敢大口呼吸\n" +
                "“小王，小莉...这一定是梦...”\n" +
                "最终晕了过去\n" +
                "——\n" +
                "【结局E】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(91, "“beng！”\n" +
                "\n" +
                "男厕门被撞开了，小辉冲了出来，脚似不稳，步履蹒跚，档间湿了一片，而此时，女厕也有诡异的人走出，披肩散发，甚是阴森\n" +
                "\n" +
                "“鬼啊，快，快跑啊！”\n" +
                "\n" +
                "一个呼吸间，小辉跑到你跟前");
        conditionContentMap.put(92, "你冲向楼道，想快些下楼，而小辉也冲向了你这边，生命的威胁让他速度竟超越了你\n" +
                "\n" +
                "后面两人扎牙舞爪被你们吸引，楼道瞬间大乱了起来\n" +
                "\n" +
                "“鬼啊，鬼啊”\n" +
                "\n" +
                "小辉边嚷着边挤进楼梯中，还踢倒了一旁女同事，你是最后几个赶到楼梯口的，回头望着倒地的女同事，救还是不救？");
        conditionContentMap.put(93, "你躲在冰箱柜后，成功躲避了追击，两个诡异的人向小辉追了出去，你轻手轻脚缓慢向外头移去");
        conditionContentMap.put(94, "你挤进9楼楼道口，走向办公区，这里人群也非常拥堵，灯光昏暗，顶上中央空调还掉落了几只\n" +
                "...\n" +
                "脚程加快，似有预感，赶到小王的办公桌上\n" +
                "这儿稿纸纷飞，文案满地，桌上的电脑早已七倒八歪，你看到了小王，小王安静的躺在椅子上睡觉，如果没看到血的话\n" +
                "...\n" +
                "——\n" +
                "【结局G】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(95, "“小王的话，他那么聪明应该没事的”\n" +
                "你这样想着，向8楼挤去，看到了，她被挤到了8楼楼道口，半缩着躲在角落里，周边来往的人群不时的推擦她的腿脚手臂\n" +
                "“让一让，让一让！”\n" +
                "你推开周围人群，特别是最后一下的出来，感觉五脏六腑都挤出来了\n" +
                "“去8楼会议室休息会吧”\n" +
                "“...”\n" +
                "小莉无言，惨白的面容昭示着方才之事\n" +
                "“抛下我吧”\n" +
                "你转头一愣，没反应出出自谁口，但人群推推嚷嚷，让你没法站此处太久\n" +
                "\n");
        conditionContentMap.put(96, "你抱起她冲向楼道口，但抱起的人与周围推搡的人群实在让你跑不太快，你后悔告诉了大家\n" +
                "“啊！”\n" +
                "后面一人应声倒地，你无法向后去看，因为恐惧使然！\n" +
                "你感觉有人抓住了你的脚？\n" +
                "“救...救救我”\n" +
                "你转头看去，一同事倒在地上，血腥渗人的画面在你面前展现，它啃咬着同事的腿，模糊的血肉能让你看到肌腱，而同事却死命的抓住了你的脚，就好像那最后一根救命稻草，死抓不放！\n" +
                "你迈不开腿\n" +
                "“松开啊，松开！TMD，草”\n" +
                "你叫着，嚷着，骂着，心跳开始加速\n" +
                "侧面猛地一凉\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(97, "你看着慌乱的人群，后悔了刚才的决定，你觉得抱着她跑，有种无法逃生的感觉，你将她安置在办公桌下，用椅子遮掩\n" +
                "\n" +
                "赶向了楼道");
        conditionContentMap.put(98, "你大声提醒危险，顿时不少人被你吸引了目光，惊慌失措\n" +
                "紧接着就发生了“大暴乱”人们四散而逃，涌向了楼道口，堵得水泄不通\n" +
                "而同时厕所处出来几个诡异的人\n" +
                "你没时间思考，直觉让你寒毛直竖，感受到了所谓生命的威胁，你一脚踢开了身边的人，闷头冲向楼道，身后传来惨痛声阵阵，你有些后悔，但你更想活下去\n" +
                "你激起了生命的本能，挤到6楼，发现再也无法自然向下\n" +
                "\n");
        conditionContentMap.put(99, "你没有提醒别人，冲进了楼道\n" +
                "\n" +
                "也有些人在往下赶，但还算不上拥挤，你来到了9楼，抬眼想起了好哥们小王在此处办公，他可是个军事迷呢，有他在，无疑会安全很多");
        conditionContentMap.put(100, "“有序离开，排队，排队！”\n" +
                "\n" +
                "你走到了楼道口指挥着，看了眼自动门\n" +
                "\n" +
                "自动门是隔绝办公与楼道的最后一扇门，用证件即可打开，也可以手动关闭，如果出现人员爆满冲向楼道的话，手动关闭可以强制进行楼道与办公区隔离，无疑会安全很多\n" +
                "\n");
        conditionContentMap.put(101, "小王陪你走进了5楼，此时5楼已荡然一空，办公区无一人存在，随着门后自动门关闭\n" +
                "小王看了一眼身后，猛地拿起椅子砸向紧急开关，外部钢化玻璃应声而碎，自动门被强制上锁了，只有从内测才能打开\n" +
                "你走向窗台，望着窗外一片乌烟瘴气，遍地狼藉的城市，你感受到一丝陌生\n" +
                "“还想着加薪不，你”\n" +
                "小王半开玩笑似的走了过来，一手搭在你肩上，另一手一滴鲜血从袖内流出，流至指尖，应是玻璃碎渣划伤的\n" +
                "“哈哈哈哈，车贷没了，房贷没了，只要能活下去，就是新生啊”\n" +
                "窗外密密麻麻的人群逃跑着，不少人被武警误杀，不少武警又被相继扑倒，坦克车上爬满了怪异的人，对比宇宙洪荒，人类是何其的渺小\n" +
                "两人对视，无言，似能从眼神中感觉到对方的坚定\n" +
                "“要一起活下去啊”\n" +
                "——\n" +
                "【结局F】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(102, "你鼓动了全身细胞向下挤，面色从绿至白，由白至灰，浑浑噩噩起来，片刻分神，你竟与小王走散了");
        conditionContentMap.put(103, "你急匆匆得挤向9楼，想起了9楼也是好哥们小王办公的地方，有他在无疑会安全很多");
        conditionContentMap.put(104, "你推搡着来往人群，挤到9楼，人流的密度与力度让你无法思考太久");
        conditionContentMap.put(105, "你冒着踩踏的风险拼命向上挤，持续了两三分钟效果仍不理想\n" +
                "\n" +
                "“谁TM的还往上挤呢？”\n" +
                "\n" +
                "不知谁爆了句粗口，你被推了下去\n" +
                "\n" +
                "按这人流密集度，9楼也是回不去了...");
        conditionContentMap.put(106, "你回到9楼，人群的密集让你喘不了气，你骂骂咧咧地走向小王处\n" +
                "\n" +
                "小王躺在地上一动不动，像是睡着了...\n" +
                "\n" +
                "——\n" +
                "\n" +
                "【结局G】\n" +
                "\n" +
                "——");
        conditionContentMap.put(107, "“9楼上不去的”\n" +
                "\n" +
                "小王似是回过了神，答道");
        conditionContentMap.put(108, "8楼依然非常拥堵，你俩拼了半条老命才挤进8楼楼道，楼道的空气让你感到窒息，缺氧非常严重，而楼道口也依然有非常多的人从内往外涌出，无法进入\n" +
                "没办法，得在角落等一会时间了\n" +
                "“...我走不动了，刚才挤的时候，脚给扭到了，要不你先下楼吧，趁现在，楼梯人数变少！”\n" +
                "正当你怀疑继续下楼会完蛋时，小王蹲着叫道\n" +
                "\n");
        conditionContentMap.put(109, "你还是决定去7楼歇一歇脚\n" +
                "你来到7楼办公大厅，除了楼道走廊人满为患之外，大厅的人意外的三三两两，并没有往里赶的意思，你靠在一个小会议室歇息，突然，会议室门打开一角，你被拉扯了进来，会议室的门又被关了上，映入眼帘的是满脸血垢的楼道总管黄叔、UI琴姐与运营小刚\n" +
                "“嘘！”\n" +
                "——\n" +
                "【结局C】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(110, "获得奖杯：\uD83C\uDFC6睚眦必报（开启隐藏支线）\n" +
                "“啊！”\n" +
                "\n" +
                "小辉被你一脚踹到地上，边想到果然如此，边冲向楼道，同时还撞到了几位同事\n" +
                "\n" +
                "你来到楼道口，回头心有余悸的看了看，厕所它没出来，看来成功拖延了几分钟；办公区的同事们还自顾自的看着窗外或整理背包，有看好戏的，也有些已走了的与准备走的\n" +
                "\n" +
                "但你没打算提醒他们");
        conditionContentMap.put(111, "闹成这么大悲剧，你甚至觉得此事是因你而起，你就不该丫的去提醒那混蛋，你拨开迎面人群，一把拉起了倒地的女同事并甩向楼道\n" +
                "\n" +
                "“谢谢！”\n" +
                "\n" +
                "她看都没看你一眼，转头挤向楼道\n" +
                "\n" +
                "你身后一寒\n" +
                "\n" +
                "——\n" +
                "\n" +
                "death\n" +
                "\n" +
                "——");
        conditionContentMap.put(112, "你咬了咬牙，打算视而不见，见而不救，你甚至觉得此事是因你而起，你就不该丫的去提醒那混蛋，你把责任推到了小辉身上，只身挤入楼道\n" +
                "\n" +
                "“啊！！！”\n" +
                "\n" +
                "身后传来阵阵女性尖叫声，你几乎能想象得出那可怕而又惨痛的感觉，像是咬在你身上\n" +
                "\n" +
                "“对不起！！！”");
        conditionContentMap.put(113, "获得奖杯：\uD83C\uDFC6不离不弃（If you do not leave, I will in life and death）\n" +
                "你无视了她的话，看着人流好些了的8楼楼道，你将她抱起，走向8楼办公区\n" +
                "\n" +
                "“为什么要救我...”\n" +
                "\n" +
                "小莉轻声道，散乱的头发盖住了半张脸，看不清表情\n" +
                "\n");
        conditionContentMap.put(114, "你冲下楼，磕磕碰碰撞到好几人，来到了6楼楼道口\n" +
                "\n" +
                "此处人满为患，几乎无法再往下挤，更无法回头，你心跳加速，有些不安，不知来源是楼上，又还是楼下\n" +
                "\n" +
                "“TMD楼下是发生啥事了，莫非1楼门口还被封住了不成？”\n" +
                "\n" +
                "你气着嚷道");
        conditionContentMap.put(115, "你走到了办公区域内，调整着楼道插队的人群，你不知道最终会有多少人进到“岐那街”，但现在让他们安全撤离才是真的\n" +
                "“什么声音？”\n" +
                "“没有啊，你太敏感了啦”\n" +
                "你身边的几位同事正互相讨论着\n" +
                "“啊，你看那是什么！”\n" +
                "突然，走在最后的一位同事指着厕所那条走道，大叫道\n" +
                "嘶哑的声音陆续传来，同事们更加恐慌了，只见厕所处爬出几只畸形诡异的人，鞠缕着半身，头发散乱看不清脸颊\n" +
                "\n");
        conditionContentMap.put(116, "你走到楼道内侧，突然，一阵尖叫声叫起，你夹着门缝看到有几只畸形诡异的人从厕所爬出，鞠缕着半身，头发散乱看不清脸颊\n" +
                "\n" +
                "“你看那是什么？”\n" +
                "\n" +
                "“好可怕啊！”\n" +
                "\n" +
                "同事们不安的情绪逐渐升高，开始不守秩序起来");
        conditionContentMap.put(117, "看着8楼楼道口人渐渐清空，你抓起小王就往里赶\n" +
                "“啊！救命啊”\n" +
                "身后听到楼层上放传来阵阵吼叫，你似是意识到什么，猛地砸向紧急关闭按钮，外部防护玻璃被你应声拍落，自动门锁上了，不点击里面按钮就无法打开，几滴被玻璃划伤的鲜血沿着手腕往下流\n" +
                "“我们暂且安全了”\n" +
                "你如是说道，一手搭到小王身上\n" +
                "小王恍恍惚惚走向窗台，你也紧随而后\n" +
                "8楼日光灯在上方吱呀吱呀的发出声响，几台嵌顶式中央空调落在地上，一片狼藉\n" +
                "一阵凉风吹过，没了玻璃窗的工作室竟是如此荒凉\n" +
                "窗外密密麻麻的人群逃跑着，不少人被武警误杀，不少武警又被相继扑倒，坦克车上爬满了怪异的人，对比宇宙洪荒，人类是何其的渺小\n" +
                "你对上了小王惶恐的眼神，坚定道\n" +
                "“要一起活下去！”\n" +
                "——\n" +
                "【结局H】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(118, "渗入心扉的恐惧与手脚麻利的冷静此时达成了奇妙的平衡，恍惚之间，来到了7楼，转头想起9楼的好哥们小王，不知能否跑下来，虽有些自我安慰，但觉得小王那么聪明，可能都已经跑出去了也未可知，你不再想，向6楼挤了下去\n" +
                "简直是一楼更比一楼堵，你被堵在7楼与6楼的楼梯之间竟无法挪动上下\n" +
                "“有鬼啊，要命啊”\n" +
                "“有丧尸啊”\n" +
                "一些嚷叫从楼梯下传来，震耳欲聋，煞有其事般在楼梯中阵阵回响\n" +
                "“别挤了，要命了啊，大家都下去，你们还上来，有病啊？”\n" +
                "“XXX，楼下TM有丧尸啊，我不管，我要上去！”\n" +
                "辱骂声不断，到底去哪儿，你开始变得犹豫不决\n" +
                "\n");
        conditionContentMap.put(119, "“...”\n" +
                "\n" +
                "小莉默然，单手划过散乱的刘海至耳边，露出了清冷的面庞\n" +
                "\n" +
                "“还不如让我死了呢...”\n" +
                "\n" +
                "小莉轻声道，你突然想起小莉的家里似是发生过什么，所以她才变得异常坚强，孤傲");
        conditionContentMap.put(120, "“噗...”\n" +
                "\n" +
                "小莉脸突然红了一下，随之又暗淡下去");
        conditionContentMap.put(121, "“...还不把我放下？”\n" +
                "小莉平淡的说到，但胸部的起伏表示着她内心并不平静\n" +
                "你愣了会，有种永远抱着那该有多好的感觉，将她安置在椅上\n" +
                "此时，你才发现小莉那清冷的面容曾留下过两行泪痕，不知是何时落下的\n" +
                "“做不到的...你做不到的”\n" +
                "“做得到！我不会让任何人伤害你”\n" +
                "不知为何，你心里堵得慌，大声叫道\n" +
                "“那如果你做不到呢？”\n" +
                "“我就...”\n" +
                "话未说完，小莉单手捂住你的嘴\n" +
                "良久，小莉低下头细声说\n" +
                "“或许...我们可以先从情侣开始”\n" +
                "“！哈哈”\n" +
                "你突然喜极而泣，终于要丢掉单身狗包袱了，笑的像个200多斤的胖子，手舞足蹈，好似就算世界末日来了也无所畏惧一般\n" +
                "小莉看着自己纤细的左腿，左靴在女厕拉扯时就脱出没了，摸了摸脚底\n" +
                "抬头看着开心得像花儿一般的你，握紧了拳头，眼神中充满坚毅\n" +
                "“我一定会让你活下来的”\n" +
                "——\n" +
                "【结局I】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(122, "速度加快，楼道人数急速减少，还差两位同事没撤离！\n" +
                "“啊！”\n" +
                "其中一位女同事摔倒在地\n" +
                "“小晓！”\n" +
                "“志博，救我！”\n" +
                "已在楼道中的男同事志博转头大叫道，满脸慌张，眼神焦急，推开周边人群要挤出\n" +
                "此时如果他挤出，必定会拖延自动门强制关闭时间，他们两人都会被关在办公楼，不过自己可趁此时逃走，如果不救，不让男同事挤出，则女同事必定无法下楼，或许还会有生命危险\n" +
                "看着愈来愈近的“它们”，不能犹豫了！\n" +
                "\n");
        conditionContentMap.put(123, "速度加快，楼道人数急速减少，还差两位同事没撤离！\n" +
                "“啊！”\n" +
                "其中一位女同事摔倒在地\n" +
                "“小晓！”\n" +
                "“志博，救我！”\n" +
                "已在楼道中的男同事志博转头大叫道，满脸慌张，眼神焦急，推开周边人群要挤出\n" +
                "此时如果他挤出，必定会拖延自动门强制关闭时间，他们两人都会被关在办公楼，不过自己可趁此时逃走，如果不救，不让男同事挤出，则女同事必定无法下楼，或许还会有生命危险\n" +
                "看着愈来愈近的“它们”，不能犹豫了！\n" +
                "\n");
        conditionContentMap.put(124, "你满头大汗，惊慌失措，一举冲进了9楼楼道，谁知门竟已强制上锁，无法打开？\n" +
                "“开门，开门啊！”\n" +
                "你敲打着楼道大门，上面的恐惧离你似越来越近\n" +
                "“你怎么不开门？”\n" +
                "“开...开了我们可能都要完蛋！”\n" +
                "里面窃窃私语，你猛地一撞，撞碎了自动门，磨砂玻璃碎一地\n" +
                "里面不少人被你举动吓得不轻，你一撇看到小辉竟也在此处，眼神躲闪\n" +
                "“CNM”\n" +
                "一拳打去\n" +
                "——\n" +
                "【结局J】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(125, "你冲进7楼，此时大厅已然没多少人了，部分藏着掖着，也有倒地不醒的\n" +
                "灯光昏暗，桌椅散乱，一切的一切都预示着未来的“不确定性”\n" +
                "你慢下身来，翻出手机，不出意外的无信号\n" +
                "“切”\n" +
                "从桌上顺手拿起一包烟，抽出点燃，腾腾的烟雾冉起\n" +
                "...\n" +
                "10点23分，近中午的太阳早已被外面的浓烟覆盖，透露出少许的深红，警鸣声，喇叭声，人群吼叫声，缓缓交织，像极了贝多芬协奏曲\n" +
                "“明天，我还能见到吗？”\n" +
                "——\n" +
                "【结局K】\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(126, "“不要过来，你过来你俩都会完蛋！”\n" +
                "不少人也推着他不让他过去\n" +
                "“gun开！”\n" +
                "志博一拳重重的砸到你脸上，你被打到倒地的女同事旁边\n" +
                "“小晓，没事吧！”\n" +
                "志博双手一挣，终是从楼道挤了出来，拉起小晓\n" +
                "“CTMD”\n" +
                "原本志博一旁的同事也被刚刚一拳稍稍边及，猛地砸向自动门强制关闭按钮\n" +
                "“你们不想活，我们还想活呢！”\n" +
                "边说着，一众人跑了下去，你们三人被锁在了10楼\n" +
                "...\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(127, "“谢谢，谢谢你！你一定要救她啊！”\n" +
                "他被人群挤了下去，你冲过去扶起了倒地的小晓\n" +
                "“能自己动吗？”\n" +
                "“脚...脚扭伤了”\n" +
                "来不及想那么多，你一把抱起了她冲向门口\n" +
                "“啊！”\n" +
                "刚跑两步，你右脚被什么抓住了，一踏空，摔了下去，怀中的小晓正好摔倒门口内侧\n" +
                "“你先下去快！”\n" +
                "“那你呢？”\n" +
                "“我会下来的！”\n" +
                "看着她一瘸一拐离开楼道，心如死灰\n" +
                "“10楼整层幸存者全逃出，仅剩我一人，哈哈哈哈”\n" +
                "右腿也被抓住了，你望着空无一人的工作室，鲜血直流、白花花脑浆洒落的它们似乎也不再可怕\n" +
                "这就是英雄吗...\n" +
                "“开什么玩笑！我还没活够，又有谁来救救我呢！！”\n" +
                "你一拳砸向地面，滴下三两滴泪水\n" +
                "\n");
        conditionContentMap.put(128, "“谢谢，谢谢你！你一定要救她啊！”\n" +
                "他被人群挤了下去，你冲过去扶起了倒地的小晓\n" +
                "“能自己动吗？”\n" +
                "“脚...脚扭伤了”\n" +
                "来不及想那么多，你一把抱起了她冲向门口\n" +
                "“啊！”\n" +
                "刚跑两步，你右脚被什么抓住了，一踏空，摔了下去，怀中的小晓正好摔倒门口内侧\n" +
                "“你先下去快！”\n" +
                "“那你呢？”\n" +
                "“我会下来的！”\n" +
                "看着她一瘸一拐离开楼道，心如死灰\n" +
                "“10楼整层幸存者全逃出，仅剩我一人，哈哈哈哈”\n" +
                "右腿也被抓住了，你望着空无一人的工作室，鲜血直流、白花花脑浆洒落的它们似乎也不再可怕\n" +
                "这就是英雄吗...\n" +
                "“开什么玩笑！我还没活够，又有谁来救救我呢！！”\n" +
                "你一拳砸向地面，滴下三两滴泪水\n" +
                "——\n" +
                "death\n" +
                "——\n" +
                "\n");
        conditionContentMap.put(129, "良久，疼痛感迟迟未来，绝望的眼神恍惚睁开\n" +
                "我还活着？\n" +
                "你环顾四周，竟发现“它们”已被砸落在远远的边上\n" +
                "“我这踢得不错吧？”\n" +
                "“算了吧，就你这三脚猫功夫，我家土拨鼠都比你厉害！”\n" +
                "“那有我厉害吗，你看那么远的那只，我拿椅子摔得！”\n" +
                "“我...我也把书包扔出去了”\n" +
                "七嘴八舌，你真的不敢相信，甚至都不敢去听，他们竟然都回来了！\n" +
                "“呦，小马，其实我回头想想还是上来比较好...我可不是听你同事们说才上来的...”\n" +
                "小王，竟然小王也回来了\n" +
                "此时，健身达人雪赵伸出一只手将你扶了起来\n" +
                "“从你开始上来提醒，到以身作则走到门外，以及最后的舍身救人，我们大家都看在眼里，你是我们的好榜样啊”\n" +
                "“就是，如果这样，我们还逃跑的，那还算什么男人，干脆连人都不要当算了”\n" +
                "高挑的小薇双手抱胸道\n" +
                "“你们...真的是”\n" +
                "此时你的内心真是倒翻了五味瓶一般，无比较杂，不可言语，也无法表述，泪水盈满眼眶，不过此时的泪非彼时的泪了\n" +
                "“那些玩意还活着呢，干他丫的！”\n" +
                "“干他丫的！”\n" +
                "“团结就是力量啊”\n" +
                "小王如是说，你看着周围大伙，泪水横手一擦，眼神坚定起来\n" +
                "“雪赵你叫几人用桌椅推过去把它们先控制好，很有可能会感染！小王你去把自动门强制锁上，其余人把掉落的空调挪到门口，堵门，女生们就四处收集下可用物品，统一调度！”\n" +
                "“好！”\n" +
                "——\n" +
                "【结局L】\n" +
                "——\n");
        return conditionContentMap;
    }
}
